{"format": "layers-model", "generatedBy": "keras v3.10.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.10.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 75, 100, 50, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer"}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 28, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}], "build_input_shape": [null, 75, 100, 50, 3]}}}, "weightsManifest": [{"paths": ["group1-shard1of31.bin", "group1-shard2of31.bin", "group1-shard3of31.bin", "group1-shard4of31.bin", "group1-shard5of31.bin", "group1-shard6of31.bin", "group1-shard7of31.bin", "group1-shard8of31.bin", "group1-shard9of31.bin", "group1-shard10of31.bin", "group1-shard11of31.bin", "group1-shard12of31.bin", "group1-shard13of31.bin", "group1-shard14of31.bin", "group1-shard15of31.bin", "group1-shard16of31.bin", "group1-shard17of31.bin", "group1-shard18of31.bin", "group1-shard19of31.bin", "group1-shard20of31.bin", "group1-shard21of31.bin", "group1-shard22of31.bin", "group1-shard23of31.bin", "group1-shard24of31.bin", "group1-shard25of31.bin", "group1-shard26of31.bin", "group1-shard27of31.bin", "group1-shard28of31.bin", "group1-shard29of31.bin", "group1-shard30of31.bin", "group1-shard31of31.bin"], "weights": [{"name": "sequential/dense/kernel", "shape": [1125000, 28], "dtype": "float32"}, {"name": "sequential/dense/bias", "shape": [28], "dtype": "float32"}]}]}