{"format": "layers-model", "generatedBy": "keras v3.10.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.10.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "lipnet_model", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 75, 100, 50, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "the_input"}, "name": "the_input", "inbound_nodes": []}, {"class_name": "ZeroPadding3D", "config": {"name": "zero1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "padding": [[1, 1], [2, 2], [2, 2]], "data_format": "channels_last"}, "name": "zero1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 75, 100, 50, 3], "dtype": "float32", "keras_history": ["the_input", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv3D", "config": {"name": "conv1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 32, "kernel_size": [3, 5, 5], "strides": [1, 2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 77, 104, 54, 3], "dtype": "float32", "keras_history": ["zero1", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "batc1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "name": "batc1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 75, 50, 25, 32], "dtype": "float32", "keras_history": ["conv1", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Activation", "config": {"name": "actv1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "relu"}, "name": "actv1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 75, 50, 25, 32], "dtype": "float32", "keras_history": ["batc1", 0, 0]}}], "kwargs": {}}]}, {"class_name": "SpatialDropout3D", "config": {"rate": 0.5, "seed": null, "name": "spatial_dropout3d", "dtype": "float32", "data_format": "channels_last"}, "name": "spatial_dropout3d", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 75, 50, 25, 32], "dtype": "float32", "keras_history": ["actv1", 0, 0]}}], "kwargs": {"training": false}}]}, {"class_name": "MaxPooling3D", "config": {"name": "max1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "pool_size": [1, 2, 2], "padding": "valid", "strides": [1, 2, 2], "data_format": "channels_last"}, "name": "max1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 75, 50, 25, 32], "dtype": "float32", "keras_history": ["spatial_dropout3d", 0, 0]}}], "kwargs": {}}]}, {"class_name": "ZeroPadding3D", "config": {"name": "zero2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "padding": [[1, 1], [2, 2], [2, 2]], "data_format": "channels_last"}, "name": "zero2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 75, 25, 12, 32], "dtype": "float32", "keras_history": ["max1", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv3D", "config": {"name": "conv2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 64, "kernel_size": [3, 5, 5], "strides": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 77, 29, 16, 32], "dtype": "float32", "keras_history": ["zero2", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "batc2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "name": "batc2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 75, 25, 12, 64], "dtype": "float32", "keras_history": ["conv2", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Activation", "config": {"name": "actv2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "relu"}, "name": "actv2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 75, 25, 12, 64], "dtype": "float32", "keras_history": ["batc2", 0, 0]}}], "kwargs": {}}]}, {"class_name": "SpatialDropout3D", "config": {"rate": 0.5, "seed": null, "name": "spatial_dropout3d_1", "dtype": "float32", "data_format": "channels_last"}, "name": "spatial_dropout3d_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 75, 25, 12, 64], "dtype": "float32", "keras_history": ["actv2", 0, 0]}}], "kwargs": {"training": false}}]}, {"class_name": "MaxPooling3D", "config": {"name": "max2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "pool_size": [1, 2, 2], "padding": "valid", "strides": [1, 2, 2], "data_format": "channels_last"}, "name": "max2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 75, 25, 12, 64], "dtype": "float32", "keras_history": ["spatial_dropout3d_1", 0, 0]}}], "kwargs": {}}]}, {"class_name": "ZeroPadding3D", "config": {"name": "zero3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "padding": [[1, 1], [1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero3", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 75, 12, 6, 64], "dtype": "float32", "keras_history": ["max2", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv3D", "config": {"name": "conv3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 96, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 77, 14, 8, 64], "dtype": "float32", "keras_history": ["zero3", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "batc3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "name": "batc3", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 75, 12, 6, 96], "dtype": "float32", "keras_history": ["conv3", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Activation", "config": {"name": "actv3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "relu"}, "name": "actv3", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 75, 12, 6, 96], "dtype": "float32", "keras_history": ["batc3", 0, 0]}}], "kwargs": {}}]}, {"class_name": "SpatialDropout3D", "config": {"rate": 0.5, "seed": null, "name": "spatial_dropout3d_2", "dtype": "float32", "data_format": "channels_last"}, "name": "spatial_dropout3d_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 75, 12, 6, 96], "dtype": "float32", "keras_history": ["actv3", 0, 0]}}], "kwargs": {"training": false}}]}, {"class_name": "MaxPooling3D", "config": {"name": "max3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "pool_size": [1, 2, 2], "padding": "valid", "strides": [1, 2, 2], "data_format": "channels_last"}, "name": "max3", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 75, 12, 6, 96], "dtype": "float32", "keras_history": ["spatial_dropout3d_2", 0, 0]}}], "kwargs": {}}]}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "layer": {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 6, 3, 96]}}}, "name": "time_distributed", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 75, 6, 3, 96], "dtype": "float32", "keras_history": ["max3", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "merge_mode": "concat", "layer": {"module": "keras.layers", "class_name": "GRU", "config": {"name": "forward_gru1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "zero_output_for_mask": true, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "reset_after": true, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 75, 1728]}}, "backward_layer": {"module": "keras.layers", "class_name": "GRU", "config": {"name": "backward_gru1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "return_sequences": true, "return_state": false, "go_backwards": true, "stateful": false, "unroll": false, "zero_output_for_mask": true, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "reset_after": true, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 75, 1728]}}}, "name": "bidirectional", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 75, 1728], "dtype": "float32", "keras_history": ["time_distributed", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "merge_mode": "concat", "layer": {"module": "keras.layers", "class_name": "GRU", "config": {"name": "forward_gru2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "zero_output_for_mask": true, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "reset_after": true, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 75, 256]}}, "backward_layer": {"module": "keras.layers", "class_name": "GRU", "config": {"name": "backward_gru2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "return_sequences": true, "return_state": false, "go_backwards": true, "stateful": false, "unroll": false, "zero_output_for_mask": true, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "reset_after": true, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 75, 256]}}}, "name": "bidirectional_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 75, 256], "dtype": "float32", "keras_history": ["bidirectional", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Dense", "config": {"name": "dense1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 28, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 75, 256], "dtype": "float32", "keras_history": ["bidirectional_1", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Activation", "config": {"name": "softmax", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "softmax"}, "name": "softmax", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 75, 28], "dtype": "float32", "keras_history": ["dense1", 0, 0]}}], "kwargs": {}}]}], "input_layers": [["the_input", 0, 0]], "output_layers": [["softmax", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "batc1/gamma", "shape": [32], "dtype": "float32"}, {"name": "batc1/beta", "shape": [32], "dtype": "float32"}, {"name": "batc1/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batc1/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "batc2/gamma", "shape": [64], "dtype": "float32"}, {"name": "batc2/beta", "shape": [64], "dtype": "float32"}, {"name": "batc2/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batc2/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batc3/gamma", "shape": [96], "dtype": "float32"}, {"name": "batc3/beta", "shape": [96], "dtype": "float32"}, {"name": "batc3/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "batc3/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "bidirectional/forward_gru1/gru_cell/kernel", "shape": [1728, 384], "dtype": "float32"}, {"name": "bidirectional/forward_gru1/gru_cell/recurrent_kernel", "shape": [128, 384], "dtype": "float32"}, {"name": "bidirectional/forward_gru1/gru_cell/bias", "shape": [2, 384], "dtype": "float32"}, {"name": "bidirectional/backward_gru1/gru_cell/kernel", "shape": [1728, 384], "dtype": "float32"}, {"name": "bidirectional/backward_gru1/gru_cell/recurrent_kernel", "shape": [128, 384], "dtype": "float32"}, {"name": "bidirectional/backward_gru1/gru_cell/bias", "shape": [2, 384], "dtype": "float32"}, {"name": "bidirectional_1/forward_gru2/gru_cell/kernel", "shape": [256, 384], "dtype": "float32"}, {"name": "bidirectional_1/forward_gru2/gru_cell/recurrent_kernel", "shape": [128, 384], "dtype": "float32"}, {"name": "bidirectional_1/forward_gru2/gru_cell/bias", "shape": [2, 384], "dtype": "float32"}, {"name": "bidirectional_1/backward_gru2/gru_cell/kernel", "shape": [256, 384], "dtype": "float32"}, {"name": "bidirectional_1/backward_gru2/gru_cell/recurrent_kernel", "shape": [128, 384], "dtype": "float32"}, {"name": "bidirectional_1/backward_gru2/gru_cell/bias", "shape": [2, 384], "dtype": "float32"}, {"name": "conv1/kernel", "shape": [3, 5, 5, 3, 32], "dtype": "float32"}, {"name": "conv1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2/kernel", "shape": [3, 5, 5, 32, 64], "dtype": "float32"}, {"name": "conv2/bias", "shape": [64], "dtype": "float32"}, {"name": "conv3/kernel", "shape": [3, 3, 3, 64, 96], "dtype": "float32"}, {"name": "conv3/bias", "shape": [96], "dtype": "float32"}, {"name": "dense1/kernel", "shape": [256, 28], "dtype": "float32"}, {"name": "dense1/bias", "shape": [28], "dtype": "float32"}]}]}